import type { Philosophy } from "../types";

export const philosophy: Philosophy = {
	mission: `テックリードは「顧客に安心と喜びを届ける」ことを使命としています。

ぼくたちが持っている能力を最大限に活かし「顧客の作りたい未来」を実現していきます。

その結果が「顧客の安心と喜び」につながると信じています。

これがテックリードが向かう先であり、ぶれない軸です。`,

	vision: `テックリードは「ギークなエンジニアの楽園」になります。

ギークなエンジニアとは、次のようなひとです。

• DBが好きで、スクラッチからDBを自作する
• プログラミング言語が好きで、スクラッチから言語を自作する
• 好きな技術に関する情報をブログやカンファレンスなどで積極的にアウトプットする
• 好きなOSSに貢献する

そんな好きな技術に夢中になるようなエンジニアへ、次の支援制度を用意しています。

• 技術書購入支援
• 社内外の勉強会やカンファレンスへの参加・登壇支援
• OSSコントリビュート支援
• テックブログ執筆支援

このようにエンジニアを全力で応援する組織、それがテックリードです。
なぜなら「自分の好きが人の喜びに繋がる」ということを知っていて、それを信じているからです。`,

	values: `テックリードの価値は「顧客に寄り添い、妥協をしない」ことです。

顧客に喜びを届けるには、顧客に寄り添うことが大事と考えています。
そのため、相手の立場に立ち、思いを理解したうえで、妥協せずともに作りたい未来を実現していきます。`,

	philosophy: `テックリードは技術的にも人間的に成長し続けます。

成長していくうえで、一番大事なのは失敗を恐れず果敢に挑戦することです。
テックリードは失敗したとしてもそれを成長の糧にして、同じ失敗を繰り返さないことを大事にしています。

社員がやってみたいこと、挑戦してみたいことを積極的に受け入れ、応援する組織です。`,

	identity: `テックリードは「学ぶことを楽しむ」人たちが集まる組織です。
学んだことを持ち寄って、互いに高め合っていくことで、自身の価値と顧客に提供できる価値を高めます。

そして、「優しさと思いやりを持つ」人たちでもあります。
「優しさ」を心に持ち「思いやり」な行動を通して、相手に思いを伝えます。
ぼくたちは互いのことを否定せず、相手と自分の違いを受け入れ、認め合うことを大事にしています。

世界を平和にするつもりはないんですが、世界の平和は「隣人と自分の違いを受け入れ、認め合う」ことから始まると信じています。`,
};
